title: Possible reverse shell command
description: Commands that look like reverse shell invocations
references:
    - https://alamot.github.io/reverse_shells/
logsource:
  service: shell
detection:
  keywords:
    - '-i >& /dev/tcp/'
    - 'exec 5<>/dev/tcp/'
    - 'nc -e /bin/sh'
    - "socat exec:'bash -li',pty,stderr,setsid,sigint,sane"
condition: keywords